app/controllers/markers_controller.rb

  def index
    user_id = Auth.decode(params["jwt"])["user_id"]
    if user_id
      user = User.find(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def create
    user_id = Auth.decode(params["jwt"])["user_id"]
    if user_id
      marker = Marker.find_by("user_id = ? AND created_at >= ?", user_id, Time.zone.now.beginning_of_day)
---
SELECT  "markers".* FROM "markers" WHERE (user_id = 21 AND created_at >= '2016-12-07 00:00:00') LIMIT $1  [["LIMIT", 1]]