app/controllers/scores_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" ORDER BY "users"."days_survived" DESC LIMIT $1  [["LIMIT", 10]]
SELECT  "users".* FROM "users" ORDER BY "users"."humans_infected" DESC LIMIT $1  [["LIMIT", 10]]
---
  def index
    user_id = Auth.decode(params["jwt"])["user_id"]
    if user_id
      user = User.find(user_id)
      users = User.all
      zombie_count = users.select {|user| user.zombie == true}.count
      human_count = users.select {|user| user.zombie == false}.count

      human_scores = User.order(days_survived: :desc).limit(10)
      human_scores_json = human_scores.each_with_object([]) do |user, array|
        array << {
          username: user.username,
          score: user.days_survived,
          key: user.username
        }
      end

      zombie_scores = User.order(humans_infected: :desc).limit(10)