app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "hey"], ["password_digest", "$2a$10$n8.mlI.hN/BFDTfix3nldeBh1uPOfCM3swdnBM989p2Za98904zgq"], ["created_at", 2016-12-01 19:37:02 UTC], ["updated_at", 2016-12-01 19:37:02 UTC]]
---
  def create
    user = User.new(user_params)

    if rand(1..6) == 6
      user.zombie = true
    else
      user.zombie = false
    end

    if user.save

SELECT  "markers".* FROM "markers" WHERE (user_id = 21 AND created_at >= '2016-12-07 00:00:00') LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    user_id = Auth.decode(params["jwt"])["user_id"]
    if user_id
      marker = Marker.find_by("user_id = ? AND created_at >= ?", user_id, Time.zone.now.beginning_of_day)
      user = User.find(user_id)